qald_version,split,question_id,sentence_en,query
6,train,74,Which capitals in Europe were host cities of the summer olympic games?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/CapitalsInEurope> .  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/HostCitiesOfTheSummerOlympicGames> . } '}
6,train,75,Who was the 16th president of the United States?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/office> 'President of the United States'^^<http://www.w3.org/2001/XMLSchema#string> .  ?uri <http://dbpedia.org/ontology/orderInOffice> '16th'^^<http://www.w3.org/2001/XMLSchema#string> . } ""}"
6,train,76,How many films did Hal Roach produce?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> . } '}
6,train,77,Which music albums contain the song Last Christmas?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?single <http://dbpedia.org/ontology/album> ?uri .  ?single <http://www.w3.org/2000/01/rdf-schema#label> 'Last Christmas'@en . } ""}"
6,train,8,Which states of Germany are governed by the Social Democratic Party?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/StatesOfGermany> .  { ?uri <http://dbpedia.org/ontology/leaderParty> <http://dbpedia.org/resource/Social_Democratic_Party_of_Germany> . } UNION  { ?uri <http://dbpedia.org/property/rulingParty> 'SPD'@en . } } ""}"
6,train,81,Which country has the most official languages?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> .  ?uri <http://dbpedia.org/property/officialLanguages> ?language . } ORDER BY DESC(COUNT(?language)) OFFSET 0 LIMIT 1 '}
6,train,82,In which programming language is GIMP written?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/GIMP> <http://dbpedia.org/ontology/programmingLanguage> ?uri . } '}
6,train,83,Who produced films starring Natalie Portman?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?film <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Natalie_Portman> .  ?film <http://dbpedia.org/ontology/producer> ?uri . } '}
6,train,85,In which films did Julia Roberts as well as Richard Gere play?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julia_Roberts> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Richard_Gere> . } '}
6,train,87,Who wrote the book The Pillars of the Earth?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Pillars_of_the_Earth> <http://dbpedia.org/ontology/author> ?uri . } '}
6,train,88,How many films did Leonardo DiCaprio star in?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> . } '}
6,train,9,In which U.S. state is Mount McKinley located?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/StatesOfTheUnitedStates> .  <http://dbpedia.org/resource/Mount_McKinley> <http://dbpedia.org/ontology/locatedInArea> ?uri . } '}
6,train,90,When was Jack Wolfskin founded?,{'sparql': 'SELECT DISTINCT ?year WHERE {  <http://dbpedia.org/resource/Jack_Wolfskin> <http://dbpedia.org/ontology/foundingYear> ?year . } '}
6,train,91,Which organizations were founded in 1930?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation> . { ?uri <http://dbpedia.org/ontology/formationYear> ?date . } UNION { ?uri <http://dbpedia.org/ontology/foundingYear> ?date. } FILTER regex(?date,'^1930') . } ""}"
6,train,92,What is the highest mountain?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain> .  ?uri <http://dbpedia.org/ontology/elevation> ?elevation . } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1 '}
6,train,93,Was Natalie Portman born in the United States?,{'sparql': 'ASK WHERE {  { <http://dbpedia.org/resource/Natalie_Portman> <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/United_States> . }  UNION  { <http://dbpedia.org/resource/Natalie_Portman> <http://dbpedia.org/ontology/birthPlace> ?city .  ?city <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_States> . } } '}
6,train,94,Which budget did the first movie of Zdenek Sverak have?,{}
6,train,95,How many big fires struck Paris during the Middle Ages?,{}
6,train,96,Is Pamela Anderson a vegan?,{}
6,train,97,How often was Michael Jordan divorced?,{}
6,train,98,What is the most beautiful painting?,{}
6,train,231,How many inhabitants does the largest city in Canada have?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/largestCity> ?city .  ?city <http://dbpedia.org/ontology/populationTotal> ?num . } '}
6,train,249,In which studio did the Beatles record their first album?,{}
6,train,234,Who was the first to climb Mount Everest?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/firstAscentPerson> ?uri . } '}
6,train,204,How many programming languages are there?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ProgrammingLanguage> . } '}
6,train,242,What is the official color of the University of Oxford?,{'sparql': 'SELECT DISTINCT ?string WHERE {  <http://dbpedia.org/resource/University_of_Oxford> <http://dbpedia.org/ontology/officialSchoolColour> ?string . } '}
6,train,250,How many gold medals did Michael Phelps win at the 2008 Olympics?,{}
6,train,223,Does Abraham Lincoln's death place have a website?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Abraham_Lincoln> <http://dbpedia.org/ontology/deathPlace> ?p .  ?p <http://dbpedia.org/property/website> ?w . } '}
6,train,244,How deep is Lake Chiemsee?,{'sparql': 'SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/Chiemsee> <http://dbpedia.org/ontology/depth> ?n . } '}
6,train,210,Who is the youngest Darts player?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/DartsPlayer> .  ?uri <http://dbpedia.org/ontology/birthDate> ?date . } ORDER BY DESC(?date) OFFSET 0 LIMIT 1 '}
6,train,221,Where was Bach born?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Johann_Sebastian_Bach> <http://dbpedia.org/ontology/birthPlace> ?uri . } '}
6,train,232,In which countries can you pay using the West African CFA franc?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/West_African_CFA_franc> . } '}
6,train,225,What are the top-10 action role-playing video games according to IGN?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://purl.org/dc/terms/subject> <http://dbpedia.org/resource/Category:Action_role-playing_video_games> .  ?uri <http://dbpedia.org/property/ign> ?score . } ORDER BY DESC(?score) LIMIT 10 '}
6,train,214,What is the most frequent cause of death?,{'sparql': 'SELECT DISTINCT ?x WHERE {  ?uri <http://dbpedia.org/ontology/deathCause> ?x . } ORDER BY DESC(COUNT(DISTINCT ?uri)) OFFSET 0 LIMIT 1 '}
6,train,207,Does the Isar flow into a lake?,{'sparql': 'ASK WHERE {  ?x <http://dbpedia.org/ontology/inflow> <http://dbpedia.org/resource/Isar> .  ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake> . } '}
6,train,212,How many pages does War and Peace have?,{'sparql': 'SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/War_and_Peace> <http://dbpedia.org/ontology/numberOfPages> ?n . } '}
6,train,217,What is the bridge with the longest span?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge> .  ?uri <http://dbpedia.org/ontology/mainspan> ?s . } ORDER BY DESC(?s) OFFSET 0 LIMIT 1 '}
6,train,216,Who is the tallest player of the Atlanta Falcons?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Atlanta_Falcons> .  ?uri <http://dbpedia.org/ontology/height> ?h . } ORDER BY DESC(?h) OFFSET 0 LIMIT 1 '}
6,train,208,Which rivers flow into a German lake?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River> .  ?x <http://dbpedia.org/ontology/inflow> ?uri .  ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Lake> .  ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> . } '}
6,train,238,How many James Bond movies are there?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/JamesBondFilms> . } '}
6,train,246,Which rockets were launched from Baikonur?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Rocket> .  ?uri <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Baikonur_Cosmodrome> . } '}
6,train,236,Which pope succeeded John Paul II?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Pope_John_Paul_II> <http://dbpedia.org/property/successor> ?uri . } '}
6,train,230,When is Halloween?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date . } '}
6,train,237,What was the last movie with Alec Guinness?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Alec_Guinness> .  ?uri <http://dbpedia.org/ontology/releaseDate> ?date . } ORDER BY DESC(?date) LIMIT 1 '}
6,train,203,Which poet wrote the most books?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Poet> .  ?x <http://dbpedia.org/ontology/author> ?uri .  ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1 '}
6,train,202,How many languages are spoken in Colombia?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Language> .  <http://dbpedia.org/resource/Colombia> <http://dbpedia.org/ontology/language> ?uri . } '}
6,train,248,What does ICRO stand for?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/abbreviation> 'ICRO'^^<http://www.w3.org/2001/XMLSchema#string> . } ""}"
6,train,228,What was Brazil's lowest rank in the FIFA World Ranking?,{'sparql': 'SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/Brazil_national_football_team> <http://dbpedia.org/property/fifaMin> ?n . } '}
6,train,239,Which actor played Chewbacca?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Chewbacca> <http://dbpedia.org/property/portrayer> ?uri . } '}
6,train,213,Which ingredients do I need for carrot cake?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Carrot_cake> <http://dbpedia.org/ontology/ingredient> ?uri . } '}
6,train,219,Is Cola a beverage?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Cola> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage> . } '}
6,train,215,Who has Tom Cruise been married to?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Tom_Cruise> . } '}
6,train,222,Which of Tim Burton's films had the highest budget?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Tim_Burton> .  ?uri <http://dbpedia.org/ontology/budget> ?b . } ORDER BY ?b OFFSET 0 LIMIT 1 '}
6,train,209,How heavy is Jupiter's lightest moon?,{'sparql': 'SELECT DISTINCT ?n WHERE {  ?uri <http://dbpedia.org/property/satelliteOf> <http://dbpedia.org/resource/Jupiter> .  ?uri <http://dbpedia.org/ontology/mass> ?n . } ORDER BY ASC(?n) OFFSET 0 LIMIT 1 '}
6,train,220,Which actor was casted in the most movies?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> .  ?f <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?f <http://dbpedia.org/ontology/starring> ?uri . } ORDER BY DESC(COUNT(DISTINCT(?f))) OFFSET 0 LIMIT 1 '}
6,train,245,Is James Bond married?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/James_Bond> <http://dbpedia.org/ontology/spouse> ?uri . } '}
6,train,206,When was Olof Palme shot?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Olof_Palme> <http://dbpedia.org/ontology/deathDate> ?date . } '}
6,train,224,Who are the four youngest MVP basketball players?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer> .  ?uri <http://dbpedia.org/ontology/birthDate> ?date.  ?uri <http://dbpedia.org/property/highlights> ?h .  FILTER regex(?h,'MVP') } ORDER BY DESC(?date) OFFSET 0 LIMIT 4 ""}"
6,train,251,Which companies have more than 1 million employees?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company> . { ?uri <http://dbpedia.org/ontology/numberOfEmployees> ?n . } UNION { ?uri <http://dbpedia.org/property/numEmployees> ?n . } FILTER ( ?n > 1000000 ) } '}
6,train,253,Who was called Rodzilla?,"{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/nickname> ""Rodzilla""@en . } '}"
6,train,255,How many museums does Paris have?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Museum> .  ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paris> . } '}
6,train,256,Which city has the most inhabitants?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City> .  ?uri <http://dbpedia.org/ontology/populationTotal> ?pop . } ORDER BY DESC(?pop) OFFSET 0 LIMIT 1 '}
6,train,257,Which city has the least inhabitants?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City> .  ?uri <http://dbpedia.org/ontology/populationTotal> ?pop . } ORDER BY ASC(?pop) OFFSET 0 LIMIT 1 '}
6,train,259,Who wrote The Hunger Games?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Hunger_Games> <http://dbpedia.org/property/creator> ?uri . } '}
6,train,261,What country is Mount Everest in?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/locatedInArea> ?uri .  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . } '}
6,train,262,Who is the founder of Penguin Books?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Penguin_Books> <http://dbpedia.org/ontology/founder> ?uri . } '}
6,train,263,Which programming languages influenced Javascript?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ProgrammingLanguage> .  ?uri <http://dbpedia.org/ontology/influenced> <http://dbpedia.org/resource/JavaScript> . } '}
6,train,264,Did Che Guevara have children?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Che_Guevara> <http://dbpedia.org/ontology/child> ?uri . } '}
6,train,267,When was the Titanic completed?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/RMS_Titanic> <http://dbpedia.org/ontology/completionDate> ?date . } '}
6,train,268,How much did Pulp Fiction cost?,{'sparql': 'SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/Pulp_Fiction> <http://dbpedia.org/ontology/budget> ?n . } '}
6,train,269,How many airlines are there?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline> . } '}
6,train,270,Who played Agent Smith in Matrix?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Agent_Smith> <http://dbpedia.org/property/portrayer> ?uri . } '}
6,train,271,How much carbs does peanut butter have?,{'sparql': 'SELECT DISTINCT ?carbs WHERE {  <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs . } '}
6,train,272,Which book has the most pages?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/numberOfPages> ?n . } ORDER BY DESC(?n) OFFSET 0 LIMIT 1 '}
6,train,273,Which bridges cross the Seine?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge> .  ?uri <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Seine> . } '}
6,train,274,Who is the mayor of the capital of French Polynesia?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/French_Polynesia> <http://dbpedia.org/ontology/capital> ?x .  ?x <http://dbpedia.org/ontology/mayor> ?uri . } '}
6,train,275,When did Dracula's creator die?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Count_Dracula> <http://dbpedia.org/ontology/creator> ?x .  ?x <http://dbpedia.org/ontology/deathDate> ?date . } '}
6,train,276,What is the location of the Houses of Parliament?,{'sparql': 'SELECT ?uri WHERE {  <http://dbpedia.org/resource/Palace_of_Westminster> <http://dbpedia.org/ontology/location> ?uri . } '}
6,train,278,Who was the pope that founded the Vatican Television?,{'sparql': 'SELECT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Pope> .  <http://dbpedia.org/resource/Vatican_Television_Center> <http://dbpedia.org/ontology/foundedBy> ?uri . } '}
6,train,279,What airlines are part of the SkyTeam alliance?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline> .  { ?uri <http://dbpedia.org/property/alliance> <http://dbpedia.org/resource/SkyTeam> . }  UNION  { ?uri <http://dbpedia.org/ontology/Alliance> <http://dbpedia.org/resource/SkyTeam> . } } '}
6,train,281,Which airports does Yeti Airlines serve?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Yeti_Airlines> <http://dbpedia.org/ontology/targetAirport> ?uri . }'}
6,train,282,In which year was Rachel Stevens born?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Rachel_Stevens> <http://dbpedia.org/ontology/birthYear> ?uri . } '}
6,train,283,Where was JFK assassinated?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri . } '}
6,train,284,How many politicians graduated from Columbia University?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Politician> .  ?uri <http://dbpedia.org/ontology/almaMater> <http://dbpedia.org/resource/Columbia_University> . } '}
6,train,286,What is the highest volcano in Africa?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Volcano> .  ?uri <http://dbpedia.org/ontology/locatedInArea> ?area .  ?area <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/AfricanCountries> .  ?uri <http://dbpedia.org/ontology/elevation> ?elevation . } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1 '}
6,train,287,Which beer originated in Ireland?,"{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> .  ?uri <http://dbpedia.org/property/origin> ""Ireland""@en . } '}"
6,train,288,What are the specialities of the UNC Health Care?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/UNC_Health_Care> <http://dbpedia.org/property/speciality> ?uri . } '}
6,train,289,Who is the owner of Facebook?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Facebook> <http://dbpedia.org/ontology/foundedBy> ?uri . } '}
6,train,290,From which region is the Melon de Bourgogne?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Melon_de_Bourgogne> <http://dbpedia.org/ontology/wineRegion> ?uri . } '}
6,train,291,Who was influenced by Socrates?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Socrates> . } '}
6,train,292,Who was president of Pakistan in 1978?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/President_of_Pakistan> .  ?uri <http://dbpedia.org/property/years> 1978 . } '}
6,train,294,Give me all types of eating disorders.,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/EatingDisorders> . } '}
6,train,295,Who was married to president Chirac?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Jacques_Chirac> <http://dbpedia.org/ontology/spouse> ?uri . } '}
6,train,296,What is the largest metropolitan area in Washington state?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri . } '}
6,train,297,Where in France is sparkling wine produced?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/wineProduced> <http://dbpedia.org/resource/Sparkling_wine> .  ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/France> . } '}
6,train,298,Where did Hillel Slovak die?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Hillel_Slovak> <http://dbpedia.org/ontology/deathPlace> ?uri . } '}
6,train,299,What is the timezone in San Pedro de Atacama?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/San_Pedro_de_Atacama> <http://dbpedia.org/ontology/timeZone> ?uri . } '}
6,train,300,In which city does the Chile Route 68 end?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Chile_Route_68> <http://dbpedia.org/ontology/routeEnd> ?uri . } '}
6,train,303,Who is the youngest Pulitzer Prize winner?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Pulitzer_Prize> .  ?uri <http://dbpedia.org/ontology/birthDate> ?d . } ORDER BY DESC(?d) OFFSET 0 LIMIT 1 '}
6,train,304,Which animals are critically endangered?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Animal> .  ?uri <http://dbpedia.org/ontology/conservationStatus> 'CR'^^<http://www.w3.org/2001/XMLSchema#string> . } ""}"
6,train,305,Which soccer players were born on Malta?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerPlayer> .  ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Malta> . } '}
6,train,306,Did Arnold Schwarzenegger attend a university?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Arnold_Schwarzenegger> <http://dbpedia.org/ontology/almaMater> ?x .  ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/University> . } '}
6,train,307,Which programming languages were influenced by Perl?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ProgrammingLanguage> . { ?uri <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Perl> . } UNION { <http://dbpedia.org/resource/Perl> <http://dbpedia.org/ontology/influenced> ?uri . } } '}
6,train,308,Is Barack Obama a democrat?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Barack_Obama> <http://dbpedia.org/ontology/party> <http://dbpedia.org/resource/Democratic_Party_(United_States)> . } '}
6,train,309,How many children does Eddie Murphy have?,{'sparql': 'SELECT DISTINCT ?n WHERE {  <http://dbpedia.org/resource/Eddie_Murphy> <http://dbpedia.org/property/children> ?n . } '}
6,train,310,Who is the oldest child of Meryl Streep?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Meryl_Streep> <http://dbpedia.org/ontology/child> ?uri .  ?uri <http://dbpedia.org/ontology/birthDate> ?d . } ORDER BY ASC(?d) OFFSET 0 LIMIT 1 '}
6,train,311,Who killed John Lennon?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person> .  ?uri <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> . } '}
6,train,313,Which frequent flyer program has the most airlines?,{'sparql': 'SELECT ?uri WHERE {  ?airline <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline> .  ?airline <http://dbpedia.org/property/frequentFlyer> ?uri.  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/FrequentFlyerPrograms> . } ORDER BY DESC(COUNT(DISTINCT ?airline)) OFFSET 0 LIMIT 1 '}
6,train,312,In which city is Air China headquartered?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Air_China> <http://dbpedia.org/ontology/headquarter> ?uri .  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/City108524735> . } '}
6,train,314,Which artists were born on the same date as Rachel Stevens?,{'sparql': 'SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Artist> . <http://dbpedia.org/resource/Rachel_Stevens> <http://dbpedia.org/property/dateOfBirth> ?date . ?uri <http://dbpedia.org/property/dateOfBirth> ?date . } '}
6,train,315,How many scientists graduated from an Ivy League university?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Scientist> . ?uri <http://dbpedia.org/ontology/almaMater> ?university . ?university <http://dbpedia.org/ontology/affiliation> <http://dbpedia.org/resource/Ivy_League> . } '}
6,train,316,Which types of grapes grow in Oregon?,{'sparql': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Oregon_wine> <http://dbpedia.org/ontology/growingGrape> ?uri . } '}
6,train,317,Who is starring in Spanish movies produced by Benicio del Toro?,{'sparql': 'SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Spain> . ?film <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Benicio_del_Toro> . ?film <http://dbpedia.org/ontology/starring> ?uri . ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person> . } '}
6,train,318,Who is the manager of Real Madrid?,{'sparql': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Real_Madrid_C.F.> <http://dbpedia.org/ontology/manager> ?uri . } '}
6,train,320,Which movies starring Mickey Rourke were directed by Guy Ritchie?,{'sparql': 'SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Mickey_Rourke> . ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Guy_Ritchie> . } '}
6,train,321,Is Darth Vader Lukes father?,"{'sparql': 'ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/children> ""Luke Skywalker""@en . }'}"
6,train,322,How many companies were founded by the founder of Facebook?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Facebook> <http://dbpedia.org/ontology/foundedBy> ?uri .  ?uri <http://dbpedia.org/ontology/foundedBy> ?uri . } '}
6,train,323,How many companies were founded in the same year as Google?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company> .  ?uri <http://dbpedia.org/ontology/foundingYear> ?year .  <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/foundingYear> ?year . } '}
6,train,324,Which subsidiary of TUI Travel serves both Glasgow and Dublin?,{'sparql': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/TUI_Travel> <http://dbpedia.org/ontology/subsidiary> ?uri .  ?uri <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Glasgow_Airport> . ?uri <http://dbpedia.org/ontology/targetAirport> <http://dbpedia.org/resource/Dublin_Airport> . } '}
6,train,325,How many airlines are members of the Star Alliance?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Airline> .  ?uri <http://dbpedia.org/property/alliance> <http://dbpedia.org/resource/Star_Alliance> . } '}
6,train,327,Which musician wrote the most books?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Musician> .  ?x <http://dbpedia.org/ontology/author> ?uri .  ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> . } ORDER BY DESC(COUNT(?x)) OFFSET 0 LIMIT 1 '}
6,train,330,In which country is Mecca located?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Mecca> <http://dbpedia.org/ontology/country> ?uri . } '}
6,train,331,What is the net income of Apple?,{'sparql': 'SELECT DISTINCT ?ni WHERE {  <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni . } '}
6,train,332,What does the abbreviation FIFA stand for?,{'sparql': 'SELECT DISTINCT ?name WHERE {  <http://dbpedia.org/resource/FIFA> <http://dbpedia.org/property/name> ?name . } '}
6,train,333,When did the Ming dynasty dissolve?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Ming_dynasty> <http://dbpedia.org/property/dateEnd> ?date . } '}
6,train,334,Which museum in New York has the most visitors?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Museum> .  ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/New_York_City> .  ?uri <http://dbpedia.org/ontology/numberOfVisitors> ?num . } ORDER BY DESC(?num) OFFSET 0 LIMIT 1 '}
6,train,335,Is Lake Baikal bigger than the Great Bear Lake?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Lake_Baikal> <http://dbpedia.org/ontology/areaTotal> ?a1 .  <http://dbpedia.org/resource/Great_Bear_Lake> <http://dbpedia.org/ontology/areaTotal> ?a2 .  FILTER (?a1 > ?a2) } '}
