[
    {
        "question": "Give me a list of all bandleaders that play trumpet.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> .  ?uri <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "109"
    },
    {
        "question": "Give me all members of Prodigy.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "114"
    },
    {
        "question": "Give me all people that were born in Vienna and died in Berlin.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Vienna> .  ?uri <http://dbpedia.org/ontology/deathPlace> <http://dbpedia.org/resource/Berlin> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "119"
    },
    {
        "question": "Give me all actors starring in movies directed by William Shatner.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> .  ?x <http://dbpedia.org/ontology/starring> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "129"
    },
    {
        "question": "Give me all Methodist politicians.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician> .  ?uri <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "131"
    },
    {
        "question": "List all games by GMT.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/GMT_Games> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "140"
    },
    {
        "question": "Who founded Intel?",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Intel> <http://dbpedia.org/ontology/foundedBy> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "141"
    },
    {
        "question": "Give me all breeds of the German Shepherd dog.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/breed> <http://dbpedia.org/resource/German_Shepherd> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "143"
    },
    {
        "question": "Who created Goofy?",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "15"
    },
    {
        "question": "Give me all islands that belong to Japan.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Island> .  ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "151"
    },
    {
        "question": "Give me all Apollo 14 astronauts.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "157"
    },
    {
        "question": "Give me the capitals of all countries in Africa.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?states <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/AfricanCountries> .  ?states <http://dbpedia.org/ontology/capital> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "16"
    },
    {
        "question": "Give me all Danish movies.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "163"
    },
    {
        "question": "Give me all launch pads operated by NASA.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/LaunchPad> .  ?uri <http://dbpedia.org/ontology/operator> <http://dbpedia.org/resource/NASA> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "164"
    },
    {
        "question": "List the children of Margaret Thatcher.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/child> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "176"
    },
    {
        "question": "Give me a list of all American inventions.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/AmericanInventions> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "182"
    },
    {
        "question": "Who created Batman?",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "184"
    },
    {
        "question": "Give me all B-sides of the Ramones.",
        "query": {
            "sparql": "SELECT DISTINCT ?string WHERE {  ?x <http://dbpedia.org/ontology/musicalArtist> <http://dbpedia.org/resource/Ramones> .  ?x <http://dbpedia.org/ontology/bSide> ?string . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "196"
    },
    {
        "question": "Give me the birthdays of all actors of the television show Charmed.",
        "query": {
            "sparql": "SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor .  ?actor <http://dbpedia.org/ontology/birthDate> ?date . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "2"
    },
    {
        "question": "Give me all communist countries.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/ideology> <http://dbpedia.org/resource/Communism> . }"
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "28"
    },
    {
        "question": "Give me all libraries established earlier than 1400.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Library> .  ?uri <http://dbpedia.org/property/established> ?year .  FILTER (?year < 1400) } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "51"
    },
    {
        "question": "List all episodes of the first season of the HBO television series The Sopranos.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/The_Sopranos> .  ?uri <http://dbpedia.org/ontology/seasonNumber> 1 . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "57"
    },
    {
        "question": "Give me all people with first name Jimmy.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> foaf:Person .  ?uri foaf:givenName 'Jimmy'@en . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "59"
    },
    {
        "question": "Give me all actors starring in Last Action Hero.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Last_Action_Hero> <http://dbpedia.org/ontology/starring> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "63"
    },
    {
        "question": "Give me all films produced by Hal Roach.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "70"
    },
    {
        "question": "Give me all books written by Danielle Steel.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "78"
    },
    {
        "question": "Give me all movies with Tom Cruise.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Tom_Cruise> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "84"
    },
    {
        "question": "Give me all female given names.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/GivenName> .  ?uri <http://dbpedia.org/ontology/gender> <http://dbpedia.org/resource/Female> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "86"
    },
    {
        "question": "Give me all soccer clubs in the Premier League.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub> .  ?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "89"
    },
    {
        "question": "Give me the grandchildren of Elvis Presley.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?child . ?child <http://dbpedia.org/ontology/child> ?uri . }"
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "240"
    },
    {
        "question": "Give me all taikonauts.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Astronaut> .  ?uri <http://dbpedia.org/ontology/nationality> <http://dbpedia.org/resource/China> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "201"
    },
    {
        "question": "When is Halloween?",
        "query": {
            "sparql": "SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "230"
    },
    {
        "question": "Give me all Swedish oceanographers.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/field> <http://dbpedia.org/resource/Oceanography> .  ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Sweden> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "243"
    },
    {
        "question": "Give me all actors who were born in Berlin.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> .  ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "226"
    },
    {
        "question": "Give me the capitals of all countries that the Himalayas run through.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/property/country> ?country .  ?country <http://dbpedia.org/ontology/capital> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "233"
    },
    {
        "question": "Is Cola a beverage?",
        "query": {
            "sparql": "ASK WHERE {  <http://dbpedia.org/resource/Cola> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Beverage> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "219"
    },
    {
        "question": "Give all swimmers that were born in Moscow.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Swimmer> .  ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "252"
    },
    {
        "question": "Show me the book that Muhammad Ali wrote.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Muhammad_Ali> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "254"
    },
    {
        "question": "Show a list of soccer clubs that play in the Bundesliga.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/SoccerClub> .  ?uri <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "260"
    },
    {
        "question": "Give me all types of eating disorders.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/EatingDisorders> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "294"
    },
    {
        "question": "Give me all Swedish holidays.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Holiday> .  ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "302"
    },
    {
        "question": "Give me the currency of China.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/China> <http://dbpedia.org/ontology/currency> ?uri . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "319"
    },
    {
        "question": "Is Darth Vader Luke\u2019s father?",
        "query": {
            "sparql": "ASK WHERE { <http://dbpedia.org/resource/Darth_Vader> <http://dbpedia.org/property/children> \"Luke Skywalker\"@en . }"
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "321"
    },
    {
        "question": "Give me all spacecrafts that flew to Mars.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Spacecraft> .  ?uri <http://dbpedia.org/property/planet> <http://dbpedia.org/resource/Mars> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "326"
    },
    {
        "question": "List the seven kings of Rome.",
        "query": {
            "sparql": "SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/King_of_Rome> . } "
        },
        "qald_version": 6,
        "split": "train",
        "question_id": "346"
    }
]