qald_version,split,question_id,sentence_en,query
6,train,336,Desserts from which country contain fish?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/type> <http://dbpedia.org/resource/Dessert> .  ?x <http://dbpedia.org/ontology/origin> ?uri .  ?x <http://dbpedia.org/ontology/ingredient> <http://dbpedia.org/resource/Fish> . } '}
6,train,337,What is the highest mountain in Italy?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain> .  ?uri <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Italy> .  ?uri <http://dbpedia.org/ontology/elevation> ?num . } ORDER BY DESC(?num) OFFSET 0 LIMIT 1 '}
6,train,338,Where did the architect of the Eiffel Tower study?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Eiffel_Tower> <http://dbpedia.org/ontology/architect> ?x .  ?x <http://dbpedia.org/property/almaMater> ?uri . } '}
6,train,339,Which Greek parties are pro-European?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/PoliticalParty> .  ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Greece> .  ?uri <http://dbpedia.org/ontology/ideology> <http://dbpedia.org/resource/Pro-Europeanism> . } '}
6,train,340,What is the height difference between Mount Everest and K2?,{'sparql': 'SELECT DISTINCT (?h1-?h2) WHERE {  <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/elevation> ?h1 .  <http://dbpedia.org/resource/K2> <http://dbpedia.org/ontology/elevation> ?h2 . } '}
6,train,341,Who is the mayor of Rotterdam?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Rotterdam> <http://dbpedia.org/ontology/leaderName> ?uri . } '}
6,train,342,In which city were the parents of Che Guevara born?,{}
6,train,343,How high is the lighthouse in Colombo?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Colombo_Lighthouse> <http://dbpedia.org/ontology/height> ?num . } '}
6,train,344,Are Taiko a kind of Japanese musical instruments?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Taiko> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/JapaneseMusicalInstruments> . } '}
6,train,345,How many ethnic groups live in Slovenia?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Slovenia> <http://dbpedia.org/ontology/ethnicGroup> ?uri . } '}
6,train,347,Who were the parents of Queen Victoria?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Queen_Victoria> <http://dbpedia.org/ontology/parent> ?uri . } '}
6,train,348,Who is the heaviest player of the Chicago Bulls?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Person> .  ?uri <http://dbpedia.org/ontology/weight> ?num . { ?uri <http://dbpedia.org/property/team> <http://dbpedia.org/resource/Chicago_Bulls> . } UNION { ?uri <http://dbpedia.org/property/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> . } UNION { ?uri <http://dbpedia.org/ontology/draftTeam> <http://dbpedia.org/resource/Chicago_Bulls> . } } ORDER BY DESC(?num) OFFSET 0 LIMIT 1 '}
6,train,349,Which volcanos in Japan erupted since 2000?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Volcano> .  ?uri <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Japan> .  ?uri <http://dbpedia.org/ontology/eruptionYear> ?date .  FILTER (year(?date) >= 2000) } '}
6,train,350,Who is the tallest basketball player?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/BasketballPlayer> .  ?uri <http://dbpedia.org/ontology/height> ?num . } ORDER BY DESC(?num) OFFSET 0 LIMIT 1 '}
