qald_version,split,question_id,sentence_en,query
6,train,10,In which country does the Ganges start?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Ganges> <http://dbpedia.org/property/sourceCountry> ?l . ?uri <http://www.w3.org/2000/01/rdf-schema#label> ?l . ?uri rdf:type <http://dbpedia.org/ontology/Country> . }'}
6,train,101,Which German cities have more than 250000 inhabitants?,{'sparql': 'SELECT DISTINCT ?uri WHERE { { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City> . } UNION { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Town> . }  ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> .  ?uri <http://dbpedia.org/ontology/populationTotal> ?population .  FILTER ( ?population > 250000 ) } '}
6,train,102,Who was John F. Kennedy's vice president?,{'sparql': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/vicePresident> ?uri . } '}
6,train,103,Who is the mayor of Tel Aviv?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Tel_Aviv> <http://dbpedia.org/ontology/leaderName> ?uri . } '}
6,train,104,How many students does the Free University in Amsterdam have?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/VU_University_Amsterdam> <http://dbpedia.org/ontology/numberOfStudents> ?num . } '}
6,train,105,What is the second highest mountain on Earth?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain> .  ?uri <http://dbpedia.org/ontology/elevation> ?elevation . } ORDER BY DESC(?elevation) OFFSET 1 LIMIT 1 '}
6,train,107,When was Alberta admitted as province?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date . } '}
6,train,108,To which countries does the Himalayan mountain system extend?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/property/country> ?uri . } '}
6,train,11,Which countries have more than ten caves?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> .  ?cave <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Cave> . { ?cave <http://dbpedia.org/ontology/location> ?uri . } UNION { ?cave <http://dbpedia.org/ontology/location> ?loc .  ?loc <http://dbpedia.org/ontology/country> ?uri . } } GROUP BY ?uri HAVING(COUNT(?cave) > 10) '}
6,train,110,What is the total amount of men and women serving in the FDNY?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/New_York_City_Fire_Department> <http://dbpedia.org/property/employees> ?num . } '}
6,train,200,Who produces Orangina?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/product> <http://dbpedia.org/resource/Orangina> . } '}
6,train,111,Who is the Formula 1 race driver with the most races?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/FormulaOneRacer> .  ?uri <http://dbpedia.org/ontology/races> ?x . } ORDER BY DESC(?x) OFFSET 0 LIMIT 1 '}
6,train,113,Who is the youngest player in the Premier League?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/team> ?x .  ?x <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> .  ?uri <http://dbpedia.org/ontology/birthDate> ?y . } ORDER BY DESC(?y) OFFSET 0 LIMIT 1 '}
6,train,115,What is the longest river?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/River> . { ?uri <http://dbpedia.org/ontology/length> ?l . } UNION { ?uri <http://dbpedia.org/property/length> ?l . } } ORDER BY DESC(?l) OFFSET 0 LIMIT 1 '}
6,train,116,Does Breaking Bad have more episodes than Game of Thrones?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Breaking_Bad> <http://dbpedia.org/ontology/numberOfEpisodes> ?x .  <http://dbpedia.org/resource/Game_of_Thrones> <http://dbpedia.org/ontology/numberOfEpisodes> ?y .  FILTER (?x > ?y) } '}
6,train,118,What were the main discoveries of the Mars rover Curiosity?,{}
6,train,12,Is proinsulin a protein?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Proinsulin> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Protein> . } '}
6,train,120,How tall is Michael Jordan?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Michael_Jordan> <http://dbpedia.org/ontology/height> ?num . } '}
6,train,121,What is the capital of Canada?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Canada> <http://dbpedia.org/ontology/capital> ?uri . } '}
6,train,122,Who is the governor of Wyoming?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Wyoming> <http://dbpedia.org/property/governor> ?uri . } '}
6,train,123,Do Prince Harry and Prince William have the same parents?,"{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Prince_William,_Duke_of_Cambridge> <http://dbpedia.org/ontology/parent> ?x .  <http://dbpedia.org/resource/Prince_Harry> <http://dbpedia.org/ontology/parent> ?x . } '}"
6,train,124,Who was the father of Queen Elizabeth II?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Elizabeth_II> <http://dbpedia.org/property/father> ?uri . } '}
6,train,125,Which U.S. state has been admitted latest?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/StatesOfTheUnitedStates> .  ?uri <http://dbpedia.org/property/admittancedate> ?x . } ORDER BY DESC(?x) OFFSET 0 LIMIT 1 '}
6,train,126,How many languages are spoken in Turkmenistan?,{'sparql': 'SELECT (COUNT(DISTINCT ?x) as ?c) WHERE {  <http://dbpedia.org/resource/Turkmenistan> <http://dbpedia.org/ontology/language> ?x . } '}
6,train,127,Butch Otter is the governor of which U.S. state?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/StatesOfTheUnitedStates> .  ?uri <http://dbpedia.org/property/governor> <http://dbpedia.org/resource/Butch_Otter> . }'}
6,train,13,Are tree frogs a type of amphibian?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Hylidae> <http://dbpedia.org/ontology/class> <http://dbpedia.org/resource/Amphibian> . } '}
6,train,130,What is the birth name of Angela Merkel?,{'sparql': 'SELECT DISTINCT ?string WHERE {  <http://dbpedia.org/resource/Angela_Merkel> <http://dbpedia.org/ontology/birthName> ?string . } '}
6,train,132,How often did Jane Fonda marry?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Jane_Fonda> <http://dbpedia.org/ontology/spouse> ?uri . } '}
6,train,134,In which military conflicts did Lawrence of Arabia participate?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/T._E._Lawrence> <http://dbpedia.org/ontology/battle> ?uri . } '}
6,train,135,Who developed Minecraft?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Minecraft> <http://dbpedia.org/ontology/developer> ?uri . } '}
6,train,136,What is the melting point of copper?,{}
6,train,138,How many inhabitants does Maribor have?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Maribor> <http://dbpedia.org/ontology/populationTotal> ?num . } '}
6,train,14,How tall is Amazon Eve?,{'sparql': 'SELECT DISTINCT ?height WHERE {  <http://dbpedia.org/resource/Amazon_Eve> <http://dbpedia.org/ontology/height> ?height . } '}
6,train,141,Who founded Intel?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Intel> <http://dbpedia.org/ontology/foundedBy> ?uri . } '}
6,train,142,Who is the husband of Amanda Palmer?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Amanda_Palmer> <http://dbpedia.org/property/spouse> ?uri . } '}
6,train,144,Which cities does the Weser flow through?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Weser> <http://dbpedia.org/ontology/city> ?uri . } '}
6,train,145,Which countries are connected by the Rhine?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Rhine> <http://dbpedia.org/property/country> ?string .  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> .  ?uri <http://www.w3.org/2000/01/rdf-schema#label> ?string . } '}
6,train,146,Which professional surfers were born in Australia?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Surfing> . { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Australia> . } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?x .  ?x <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> . } } '}
6,train,147,What is the average temperature on Hawaii?,{}
6,train,148,In which UK city are the headquarters of the MI6?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Secret_Intelligence_Service> <http://dbpedia.org/ontology/headquarter> ?uri .  ?uri <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/United_Kingdom> . } '}
6,train,149,Which weapons did Heckler & Koch develop?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Weapon> . ?uri <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Heckler_&_Koch> .  }'}
6,train,15,Who created Goofy?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri . } '}
6,train,150,Was the Cuban Missile Crisis earlier than the Bay of Pigs Invasion?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Cuban_Missile_Crisis> <http://dbpedia.org/ontology/date> ?x .  <http://dbpedia.org/resource/Bay_of_Pigs_Invasion> <http://dbpedia.org/ontology/date> ?y .  FILTER (?x < ?y) } '}
6,train,152,Who invented the zipper?,{}
6,train,153,What is the ruling party in Lisbon?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Lisbon> <http://dbpedia.org/property/leaderParty> ?uri . } '}
6,train,154,What are the nicknames of San Francisco?,{'sparql': 'SELECT DISTINCT ?string WHERE {  <http://dbpedia.org/resource/San_Francisco> <http://dbpedia.org/property/nickname> ?string . } '}
6,train,155,Which Greek goddesses dwelt on Mount Olympus?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/GreekGoddesses> .  ?uri <http://dbpedia.org/property/abode> <http://dbpedia.org/resource/Mount_Olympus> . } '}
6,train,156,When were the Hells Angels founded?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date . } '}
6,train,158,What is the time zone of Salt Lake City?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Salt_Lake_City> <http://dbpedia.org/property/timezone> ?uri . } '}
6,train,159,Which U.S. states are in the same time zone as Utah?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Utah> <http://dbpedia.org/property/timezone> ?x .  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/StatesOfTheUnitedStates> .  ?uri <http://dbpedia.org/property/timezone> ?x .  FILTER (?uri != <http://dbpedia.org/resource/Utah>) } '}
6,train,161,How many missions does the Soyuz programme have?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> . } '}
6,train,162,Did Socrates influence Aristotle?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Socrates> <http://dbpedia.org/ontology/influenced> <http://dbpedia.org/resource/Aristotle> . } '}
6,train,165,Which instruments does Cat Stevens play?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Cat_Stevens> <http://dbpedia.org/ontology/instrument> ?uri . } '}
6,train,166,Which ships were called after Benjamin Franklin?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/shipNamesake> <http://dbpedia.org/resource/Benjamin_Franklin> . } '}
6,train,167,Who are the parents of the wife of Juan Carlos I?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Juan_Carlos_I_of_Spain> <http://dbpedia.org/ontology/spouse> ?x .  ?x <http://dbpedia.org/ontology/parent> ?uri . } '}
6,train,168,How many employees does Google have?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num . } '}
6,train,169,Did Tesla win a nobel prize in physics?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Nikola_Tesla> <http://dbpedia.org/ontology/award> <http://dbpedia.org/resource/Nobel_Prize_in_Physics> . } '}
6,train,170,Is Rita Wilson the wife of Tom Hanks?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Tom_Hanks> <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Rita_Wilson> . } '}
6,train,171,When was the Statue of Liberty built?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Statue_of_Liberty> <http://dbpedia.org/property/beginningDate> ?date . } '}
6,train,172,Where is Fort Knox located?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Fort_Knox> <http://dbpedia.org/property/location> ?uri . }'}
6,train,173,How many children did Benjamin Franklin have?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  <http://dbpedia.org/resource/Benjamin_Franklin> <http://dbpedia.org/ontology/child> ?uri . } '}
6,train,174,When did Michael Jackson die?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Michael_Jackson> <http://dbpedia.org/ontology/deathDate> ?date . } '}
6,train,175,Which Chess players died in the same place they were born in?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/ChessPlayer> .  ?uri <http://dbpedia.org/ontology/birthPlace> ?x .  ?uri <http://dbpedia.org/ontology/deathPlace> ?y .  FILTER (?x = ?y) . } '}
6,train,177,Who was called Frank The Tank?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/property/nickname> 'Frank The Tank'@en . } ""}"
6,train,178,Was Margaret Thatcher a chemist?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> . } '}
6,train,179,Was Marc Chagall a jew?,"{'sparql': ""ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> <http://dbpedia.org/property/ethnicity> 'Jewish'@en . } ""}"
6,train,18,Which museum exhibits The Scream by Munch?,{'sparql': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Scream> <http://dbpedia.org/ontology/museum> ?uri . } '}
6,train,181,Which books by Kerouac were published by Viking Press?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Book> .  ?uri <http://dbpedia.org/ontology/publisher> <http://dbpedia.org/resource/Viking_Press> .  ?uri <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Jack_Kerouac> . } '}
6,train,183,How high is the Mount Everest?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Mount_Everest> <http://dbpedia.org/ontology/elevation> ?num. } '}
6,train,184,Who created Batman?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Batman> <http://dbpedia.org/ontology/creator> ?uri . } '}
6,train,185,How many people live in the capital of Australia?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Australia> <http://dbpedia.org/ontology/capital> ?x .  ?x <http://dbpedia.org/ontology/populationTotal> ?num . } '}
6,train,186,What is the largest city in Australia?,{'sparql': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Australia> <http://dbpedia.org/ontology/largestCity> ?uri . } '}
6,train,187,Who composed the music for Harold and Maude?,{'sparql': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Harold_and_Maude> <http://dbpedia.org/ontology/musicComposer> ?uri . } '}
6,train,188,Which films starring Clint Eastwood did he direct himself?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Clint_Eastwood> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Clint_Eastwood> . } '}
6,train,189,In which city was the former Dutch queen Juliana buried?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/ontology/restingPlace> ?uri.  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Settlement> . } '}
6,train,19,Is Egypts largest city also its capital?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Egypt> <http://dbpedia.org/ontology/largestCity> ?large .  <http://dbpedia.org/resource/Egypt> <http://dbpedia.org/ontology/capital> ?capital .  FILTER (?large = ?capital) } '}
6,train,190,Where is the residence of the prime minister of Spain?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Prime_Minister_of_Spain> <http://dbpedia.org/property/residence> ?uri . } '}
6,train,191,Which U.S. state has the abbreviation MN?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/StatesOfTheUnitedStates> .  ?uri <http://dbpedia.org/property/postalabbreviation> 'MN'@en . } ""}"
6,train,193,Which movies did Kurosawa direct?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Akira_Kurosawa> . } '}
6,train,194,What is the founding year of the brewery that produces Pilsner Urquell?,{'sparql': 'SELECT DISTINCT ?num WHERE {  <http://dbpedia.org/resource/Pilsner_Urquell> <http://dbpedia.org/property/brewery> ?uri .  ?uri <http://dbpedia.org/property/foundation> ?num . } '}
6,train,195,Who wrote the lyrics for the Polish national anthem?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Poland> <http://dbpedia.org/ontology/anthem> ?x .  ?x <http://dbpedia.org/property/author> ?uri . } '}
6,train,197,Who painted The Storm on the Sea of Galilee?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Storm_on_the_Sea_of_Galilee> <http://dbpedia.org/property/artist> ?uri . } '}
6,train,198,Which country does the creator of Miffy come from?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Miffy> <http://dbpedia.org/ontology/creator> ?x .  ?x <http://dbpedia.org/ontology/nationality> ?uri . } '}
6,train,199,For which label did Elvis record his first album?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?x <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Album> .  ?x <http://dbpedia.org/ontology/artist> <http://dbpedia.org/resource/Elvis_Presley> .  ?x <http://dbpedia.org/ontology/releaseDate> ?y .  ?x <http://dbpedia.org/ontology/recordLabel> ?uri . } ORDER BY ASC(?y) OFFSET 0 LIMIT 1 '}
6,train,20,How many employees does IBM have?,{'sparql': 'SELECT DISTINCT ?number WHERE {  <http://dbpedia.org/resource/IBM> <http://dbpedia.org/ontology/numberOfEmployees> ?number . } '}
6,train,21,Which states border Illinois?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Illinois> <http://dbpedia.org/property/borderingstates> ?uri . } '}
6,train,22,In which country is the Limerick Lake?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Limerick_Lake> <http://dbpedia.org/ontology/country> ?uri . } '}
6,train,23,Which television shows were created by John Cleese?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/TelevisionShow> .  ?uri <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/John_Cleese> . } '}
6,train,24,Which mountain is the highest after the Annapurna?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Annapurna> <http://dbpedia.org/ontology/elevation> ?elevation .  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain> .  ?uri <http://dbpedia.org/ontology/elevation> ?otherelevation .  FILTER (?otherelevation < ?elevation) . } ORDER BY DESC(?otherelevation) OFFSET 0 LIMIT 1 '}
6,train,25,In which films directed by Garry Marshall was Julia Roberts starring?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Julia_Roberts> .  ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Garry_Marshall> . } '}
6,train,26,Which bridges are of the same type as the Manhattan Bridge?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Bridge> .  ?uri <http://dbpedia.org/property/design> ?design .  <http://dbpedia.org/resource/Manhattan_Bridge> <http://dbpedia.org/property/design> ?mdesign .  FILTER (?design = ?mdesign && ?uri != <http://dbpedia.org/resource/Manhattan_Bridge>) .} '}
6,train,27,Was U.S. president Jackson involved in a war?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Andrew_Jackson> <http://dbpedia.org/ontology/battle> ?battle . } '}
6,train,29,Which awards did Douglas Hofstadter win?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Douglas_Hofstadter> <http://dbpedia.org/ontology/award> ?uri . } '}
6,train,3,Who is the daughter of Robert Kennedy married to?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Robert_F._Kennedy> <http://dbpedia.org/ontology/child> ?child .  ?child <http://dbpedia.org/ontology/spouse> ?uri . } '}
6,train,30,Which U.S. state has the highest population density?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/StatesOfTheUnitedStates> .  ?uri <http://dbpedia.org/property/densityrank> ?rank . } ORDER BY ASC(?rank) OFFSET 0 LIMIT 1 '}
6,train,31,What is the currency of the Czech Republic?,{'sparql': 'SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Czech_Republic> <http://dbpedia.org/ontology/currency> ?uri . } '}
6,train,32,Which countries adopted the Euro?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> .  { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Euro> . }  UNION  { ?uri <http://dbpedia.org/property/currencyCode> 'EUR'@en . } } ""}"
6,train,33,What is the area code of Berlin?,{'sparql': 'SELECT DISTINCT ?string WHERE {  <http://dbpedia.org/resource/Berlin> <http://dbpedia.org/ontology/areaCode> ?string . } '}
6,train,34,Which countries have more than two official languages?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> .  ?uri <http://dbpedia.org/ontology/officialLanguage> ?language . } GROUP BY ?uri HAVING (COUNT(?language) > 2) '}
6,train,35,Who is the owner of Rolls-Royce?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Rolls-Royce_Motors> <http://dbpedia.org/ontology/owner> ?uri . } '}
6,train,36,Through which countries does the Yenisei river flow?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Yenisei_River> <http://dbpedia.org/ontology/country> ?uri . } '}
6,train,37,When did Latvia join the EU?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Latvia> <http://dbpedia.org/property/accessioneudate> ?date . } '}
6,train,38,Which politicians were married to a German?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Politician> .  ?uri <http://dbpedia.org/ontology/spouse> ?spouse . { ?spouse <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> . } UNION { ?spouse <http://dbpedia.org/ontology/birthPlace> ?p .  ?p <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> . } } '}
6,train,39,When was the Battle of Gettysburg?,{'sparql': 'SELECT DISTINCT ?date WHERE {  <http://dbpedia.org/resource/Battle_of_Gettysburg> <http://dbpedia.org/ontology/date> ?date . } '}
6,train,4,Which river does the Brooklyn Bridge cross?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Brooklyn_Bridge> <http://dbpedia.org/ontology/crosses> ?uri . } '}
6,train,40,What is the highest mountain in Australia?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain> .  ?uri <http://dbpedia.org/ontology/locatedInArea> <http://dbpedia.org/resource/Australia> .  ?uri <http://dbpedia.org/ontology/elevation> ?elevation . } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1 '}
6,train,42,What is the official language of Suriname?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Suriname> <http://dbpedia.org/ontology/officialLanguage> ?uri . } '}
6,train,44,Who designed the Brooklyn Bridge?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Brooklyn_Bridge> <http://dbpedia.org/ontology/architect> ?uri . } '}
6,train,45,Which telecommunications organizations are located in Belgium?,"{'sparql': ""SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Organisation> . { ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Telecommunication> . } UNION { ?uri <http://dbpedia.org/property/industry> ?industry .  FILTER (regex(?industry,'Telecommunications')) . } { ?uri <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Belgium> . } UNION { ?uri <http://dbpedia.org/property/locationCountry> 'Belgium'@en . } } ""}"
6,train,46,Is Frank Herbert still alive?,{'sparql': 'ASK WHERE {  OPTIONAL { <http://dbpedia.org/resource/Frank_Herbert> <http://dbpedia.org/ontology/deathDate> ?date . }  FILTER (!BOUND(?date)) } '}
6,train,47,What is the highest place of the Urals?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Ural_Mountains> <http://dbpedia.org/property/highest> ?uri . } '}
6,train,48,Who is the editor of Forbes?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Forbes> <http://dbpedia.org/ontology/editor> ?uri . } '}
6,train,5,How many countries are there in Europe?,{'sparql': 'SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/class/yago/EuropeanCountries> . } '}
6,train,50,What did Bruce Carver die from?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Bruce_Carver> <http://dbpedia.org/ontology/deathCause> ?uri . } '}
6,train,52,Which presidents were born in 1945?,"{'sparql': ""SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/President> .  ?uri <http://dbpedia.org/ontology/birthDate> ?date .  FILTER regex(?date, '^1945') . } ""}"
6,train,54,Who was the wife of U.S. president Lincoln?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Abraham_Lincoln> <http://dbpedia.org/ontology/spouse> ?uri. } '}
6,train,55,Who developed the video game World of Warcraft?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/World_of_Warcraft> <http://dbpedia.org/ontology/developer> ?uri . } '}
6,train,56,What is the official website of Tom Cruise?,{'sparql': 'SELECT DISTINCT ?string WHERE {  <http://dbpedia.org/resource/Tom_Cruise> <http://dbpedia.org/property/website> ?string . } '}
6,train,58,Who produced the most films?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> .  ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1 '}
6,train,6,In which city did John F. Kennedy die?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri .  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/City> . } '}
6,train,60,Is there a video game called Battle Chess?,"{'sparql': ""ASK WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/VideoGame> .  ?uri <http://www.w3.org/2000/01/rdf-schema#label> 'Battle Chess'@en . } ""}"
6,train,61,Which mountains are higher than the Nanga Parbat?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Nanga_Parbat> <http://dbpedia.org/ontology/elevation> ?elevation .  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Mountain> . { ?uri <http://dbpedia.org/ontology/elevation> ?otherelevation . } UNION { ?uri <http://dbpedia.org/property/elevationM> ?otherelevation . }  FILTER (?otherelevation > ?elevation) . } '}
6,train,62,Who created Wikipedia?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/Wikipedia> <http://dbpedia.org/ontology/author> ?uri . } '}
6,train,65,Which companies work in the aerospace industry as well as in medicine?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Company> .  ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Aerospace> .  ?uri <http://dbpedia.org/ontology/industry> <http://dbpedia.org/resource/Medicine> . } '}
6,train,66,Is Christian Bale starring in Velvet Goldmine?,{'sparql': 'ASK WHERE {  <http://dbpedia.org/resource/Velvet_Goldmine> <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Christian_Bale> . } '}
6,train,68,Which actors were born in Germany?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Actor> . { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> . } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place .  ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> . } } '}
6,train,69,Which caves have more than 3 entrances?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Cave> .  ?uri <http://dbpedia.org/property/entranceCount> ?entrance .  FILTER (?entrance > 3) . } '}
6,train,7,Was the wife of president Lincoln called Mary?,"{'sparql': ""ASK WHERE {  <http://dbpedia.org/resource/Abraham_Lincoln> <http://dbpedia.org/ontology/spouse> ?spouse .  ?spouse <http://www.w3.org/2000/01/rdf-schema#label> ?name .  FILTER(regex(?name,'Mary')) } ""}"
6,train,72,Which languages are spoken in Estonia?,{'sparql': 'SELECT DISTINCT ?uri WHERE {  ?uri <http://dbpedia.org/ontology/spokenIn> <http://dbpedia.org/resource/Estonia> . } '}
6,train,73,How many Aldi stores are there?,{'sparql': 'SELECT DISTINCT ?number WHERE {  <http://dbpedia.org/resource/Aldi> <http://dbpedia.org/ontology/numberOfLocations> ?number . } '}
